AUTO_config_TK_pesok/src/Enums/ВариантыНавигацииВФормахНоменклатуры/ВариантыНавигацииВФормахНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВариантыНавигацииВФормахНоменклатуры</name>
  <enumValues>
    <name>ПоИерархии</name>
  </enumValues>
  <enumValues>
    <name>ПоВидам</name>
    <comment>Синоним должен быть как имя</comment>
  </enumValues>
  <enumValues>
    <name>ПоВидамИСвойствам</name>
  </enumValues>
  <enumValues>
    <name>ПоТоварамДругогоКачества</name>
  </enumValues>
  <enumValues>
    <name>ПоСовместноПродаваемымТоварам</name>
  </enumValues>
  <enumValues>
    <name>ПоИерархииПоставщика</name>
  </enumValues>
  <enumValues>
    <name>ПоСвойствам</name>
  </enumValues>
  <enumValues>
    <name>ПоНоменклатуре</name>
  </enumValues>
  <enumValues>
    <name>ПоНоменклатуреПоставщика</name>
  </enumValues>
</mdclass:Enum>

AUTO_config_TK_pesok/src/CommonModules/ТК_ПодборТоваровКлиент/Module.bsl
// Возвращает текст предупреждения по коду ошибки расширенного поиска.
//
// Параметры:
//	КодОшибки - Строка - код ошибки расширенного поиска.
//
// Возвращаемое значение:
//	Строка - текст предупреждения ошибки расширеннго поиска.
//
Функция ТекстПредупрежденияОшибкиРасширенногоПоиска(КодОшибки)
	
	Если КодОшибки = "НичегоНеНайдено" Тогда
		ТекстПредупреждения = НСтр("ru='Ничего не найдено, уточните запрос.';uk='Нічого не знайдено, уточніть запит.'");
	ИначеЕсли КодОшибки = "СлишкомМногоРезультатов" Тогда
		ТекстПредупреждения = НСтр("ru='Слишком много результатов поиска, уточните запрос.';uk='Занадто багато результатів пошуку, уточніть запит.'");
	ИначеЕсли КодОшибки = "ОшибкаПоиска" Тогда
		ТекстПредупреждения = НСтр("ru='При выполнении поиска произошла ошибка, попробуйте изменить выражение поиска.';uk='При виконанні пошуку сталася помилка, спробуйте змінити вираз пошуку.'");
	Иначе
		ТекстПредупреждения = "";
	КонецЕсли;
	
	Возврат ТекстПредупреждения;
	
КонецФункции




// Если используется полнотекстовый поиск, то функция проверяет актуальность индекса.
// Если индекс не актуален, то отображается диалог с предложением обновить индекс
// полнотекстового поиска. Если пользователь отказывается от обновления индекса,
// то все равно разрешается выполнить расширенный поиск, т.к. допускается что сведения
// касающие товаров часто не меняются.
//
// Параметры:
//	Форма - УправляемаяФорма - форма из которой выполняется вызов функции поиска.
//
// Возвращаемое значение:
//	Булево. Истина - выполнение поиска товаров возможно, Ложь - нет.
//
Процедура ВыполнениеРасширенногоПоискаВозможно(Форма, ОповещениеПослеПроверки) Экспорт
	
	// При включении флажка "Поиск по точному соответствию", выполняется неполнотекстовый поиск, 
	// соответственно, не нужно проверять актуальность индекса полнотекстового поиска.
	Если Форма.НайтиНоменклатуруПоТочномуСоответствию Тогда
		ВыполнитьОбработкуОповещения(ОповещениеПослеПроверки);
		Возврат;
	КонецЕсли;
	
	// Проверка необходима только при использовании полнотекстового поиска.
	Если Не Форма.ИспользоватьПолнотекстовыйПоиск Тогда
		ВыполнитьОбработкуОповещения(ОповещениеПослеПроверки);
		Возврат;
	КонецЕсли;
	
	Если Форма.ИнформационнаяБазаФайловая И Не Форма.ИндексПолнотекстовогоПоискаАктуален Тогда
		Результат = Неопределено;

		ПоказатьВопрос(
			Новый ОписаниеОповещения("ВыполнениеРасширенногоПоискаВозможноЗавершение", 
				ЭтотОбъект, 
				Новый Структура("ОповещениеПослеПроверки, Форма", ОповещениеПослеПроверки, Форма)), 
			НСтр("ru='Индекс полнотекстового поиска неактуален. Обновить индекс?';uk='Індекс повнотекстового пошуку неактуальний. Оновити індекс?'"), 
			РежимДиалогаВопрос.ДаНет);
		Возврат;
	КонецЕсли;
	
	ВыполнитьОбработкуОповещения(ОповещениеПослеПроверки);
	
КонецПроцедуры

// Обрабатывает флаг возврата функции выполнения поиска номенклатуры.
// Если поиск не был выполнен, то выводится предупреждение.
//
// Параметры:
//	Форма - УправляемаяФорма - форма из которой вызывалась функция поиска товаров по строке,
//	ОтображатьПредупреждение - Булево - флаг отображения предупреждения, при неудачном поиске.
//
Процедура ПослеВыполненияПоискаНоменклатуры(Форма, ОтображатьПредупреждение = Истина) Экспорт
	
	ПоискВыполнен = Не Форма.ПоискНоменклатурыНеУдачный;
	КодОшибки = Форма.КодОшибкиПоиска;
	
	СтрокаПоиска = Форма.СтрокаПоискаНоменклатура;
	
	Если ЗначениеЗаполнено(СтрокаПоиска) Тогда
		Если Не ПоискВыполнен И ОтображатьПредупреждение Тогда
			ПоказатьПредупреждение(,ТекстПредупрежденияОшибкиРасширенногоПоиска(КодОшибки), 120, "Поиск");
		КонецЕсли;
		ТК_СпискиВыбораКлиентСервер.ОбновитьСписокВыбора(Форма.Элементы.СтрокаПоискаНоменклатура.СписокВыбора, СтрокаПоиска, 21);
	КонецЕсли;
	
	//// Установить текущий элемент формы.
	//Если Не ПодборТоваровКлиентСервер.ЭтоФормаПодбораТоваровПоКатегориям(Форма) Тогда
	//	ТекущийЭлемент = Форма.Элементы[ПодборТоваровКлиентСервер.ИмяСпискаНоменклатурыПоВариантуПоиска(Форма)];
	//Иначе
		ТекущийЭлемент = Форма.Элементы["СписокРасширенныйПоискНоменклатура"];
	//КонецЕсли;
	
	Если Не ПоискВыполнен Тогда
		ТекущийЭлемент = Форма.Элементы.СтрокаПоискаНоменклатура;
	КонецЕсли;
	
	Форма.ТекущийЭлемент = ТекущийЭлемент;
	
КонецПроцедуры




// Процедура вызывается при активизации строки списка номенклатуры.
//
// Параметры:
//	Форма - УправляемаяФорма - форма списка.
//
Процедура ПриАктивизацииСтрокиСпискаНоменклатуры(Форма) Экспорт
	
	Форма.ПодключитьОбработчикОжидания("СписокПриАктивизацииСтрокиОбработчикОжидания", 0.1, Истина);
	
КонецПроцедуры



// Устанавливает текущую строку иерархии номенклатуры в формах списков номенклатуры и подборов.
//
//	Форма - УправляемаяФорма - форма списка, форма подбора.
//
Процедура УстановитьТекущуюСтрокуИерархииНоменклатуры(Форма) Экспорт
	
	Если Форма.ИспользоватьФильтры
		И Не (Форма.ВариантНавигации = ПредопределенноеЗначение("Перечисление.ВариантыНавигацииВФормахНоменклатуры.ПоСвойствам")
		Или Форма.ВариантНавигации = ПредопределенноеЗначение("Перечисление.ВариантыНавигацииВФормахНоменклатуры.ПоВидамИСвойствам")
		Или Форма.ВариантНавигации = ПредопределенноеЗначение("Перечисление.ВариантыНавигацииВФормахНоменклатуры.ПоВидам") 
		Или Форма.ВариантНавигации = ПредопределенноеЗначение("Перечисление.ВариантыНавигацииВФормахНоменклатуры.ПоИерархии")) Тогда
		Возврат;
	КонецЕсли;
	
	ЭтоФормаПодбора = ТК_ПодборТоваровКлиентСервер.ЭтоФормаПодбора(Форма);
	
	ИмяСпискаНоменклатуры = ТК_ПодборТоваровКлиентСервер.ИмяСпискаНоменклатурыПоВариантуПоиска(Форма);
	
	ТекущаяСтрока = Форма.Элементы[ИмяСпискаНоменклатуры].ТекущаяСтрока;
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(ТекущаяСтрока) = Тип("СтрокаГруппировкиДинамическогоСписка") Тогда
		Возврат;
	КонецЕсли;
	
	//Если ЭтоФормаПодбора И Форма.НавигацияПоХарактеристикам Тогда
	//	Возврат;
	//КонецЕсли;
	
	ТекущиеДанные = Форма.Элементы[ИмяСпискаНоменклатуры].ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	//Если Форма.ВариантНавигации = ПредопределенноеЗначение("Перечисление.ВариантыНавигацииВФормахНоменклатуры.ПоИерархии") Тогда
		
		Если Форма.Элементы.ИерархияНоменклатуры.ТекущаяСтрока = ТекущиеДанные.Родитель Тогда
			Возврат;
		КонецЕсли;
		
		Форма.Элементы.ИерархияНоменклатуры.ТекущаяСтрока = ТекущиеДанные.Родитель;
		Форма.ТекущаяИерархияНоменклатуры                 = ТекущиеДанные.Родитель;
	//Иначе
	//	
	//	Если Форма.Элементы.ВидыНоменклатуры.ТекущаяСтрока = ТекущиеДанные.ВидНоменклатуры Тогда
	//		Возврат;
	//	КонецЕсли;
	//	
	//	Форма.Элементы.ВидыНоменклатуры.ТекущаяСтрока = ТекущиеДанные.ВидНоменклатуры;
	//	Форма.ВидНоменклатуры = ТекущиеДанные.ВидНоменклатуры; 
	//	  
	//КонецЕсли;
	
КонецПроцедуры


// Процедура вызывается при активизации строки списка иерархии номенклатуры.
//
// Параметры:
//	Форма - УправляемаяФорма - форма списка, форма подборов.
//
Процедура ПриАктивизацииСтрокиИерархииНоменклатуры(Форма) Экспорт
	
	Если Не Форма.ИспользоватьФильтры Тогда
		Возврат;
	КонецЕсли;
	
	Если Не (Форма.ВариантНавигации = ПредопределенноеЗначение("Перечисление.ВариантыНавигацииВФормахНоменклатуры.ПоИерархии")) Тогда
		Возврат;
	КонецЕсли;
	
	Форма.ПодключитьОбработчикОжидания("ИерархияНоменклатурыПриАктивизацииСтрокиОбработчикОжидания", 0.1, Истина);
	
КонецПроцедуры

// Процедура вызывается при активизации строки списка иерархии номенклатуры.
//
// Параметры:
//	Форма - УправляемаяФорма - форма списка, форма подборов.
//
Процедура ОбработчикАктивизацииСтрокиИерархииНоменклатуры(Форма) Экспорт
	
	//// &ЗамерПроизводительности
	//ОценкаПроизводительностиКлиентСервер.НачатьЗамерВремени(
	//	"ОбщийМодуль.ПодборТоваровКлиент.ОбработчикАктивизацииСтрокиИерархииНоменклатуры");
	
	Если Форма.ТекущаяИерархияНоменклатуры = Форма.Элементы.ИерархияНоменклатуры.ТекущаяСтрока Тогда
		Возврат;
	КонецЕсли;
	
	Форма.ТекущаяИерархияНоменклатуры = Форма.Элементы.ИерархияНоменклатуры.ТекущаяСтрока;
	
	ТК_ПодборТоваровКлиентСервер.УстановитьОтборПоИерархииНоменклатуры(Форма);
	//
	//Если ТК_ПодборТоваровКлиентСервер.ЭтоФормаПодбора(Форма) И Форма.НавигацияПоХарактеристикам Тогда
	//	ПерейтиКСпискуНоменклатуры(Форма);
	//КонецЕсли;

КонецПроцедуры
